In [1]:
import pandas as pd
import numpy as np

In [9]:
df = pd.read_csv('E:/MANDAR/MANHOLE PROJECT/Manhole Monitoring System - fake_datasett.csv')
df.head()

   mq2        Date  Time  Water Level  Methane (ppm)  CO2 (ppm)
0  674  01-01-2022   NaN        71.82        7166.12    8701.97
1  646  01-01-2022   NaN        75.71        2075.56    6941.34
2  590  01-01-2022   NaN        64.61         651.11    2576.00
3  627  01-01-2022   NaN         1.84          62.18     496.61
4  896  01-01-2022   NaN        58.11         620.25    2727.11

In [10]:
len(df['mq2'])

1844

In [11]:
import random
import csv
from datetime import datetime, timedelta

In [12]:
def generate_methane_level(mq2_level):
    if  mq2_level <= 550:
        return round(random.uniform(10, 100), 2)
    elif mq2_level <= 730:
        return round(random.uniform(100, 1000), 2)
    else:
        return round(random.uniform(1000, 8000), 2)
    
def generate_co2_level(mq2_level):
    if mq2_level <= 550:
        return round(random.uniform(200, 800), 2)
    elif mq2_level <= 730:
        return round(random.uniform(800, 3000), 2)
    else:
        return round(random.uniform(3000, 10000), 2)

In [13]:
df['Methane (ppm)'] = df['mq2'].apply(lambda x: generate_methane_level(x))
df['CO2 (ppm)'] = df['mq2'].apply(lambda x: generate_co2_level(x))

In [14]:
df.head()

   mq2        Date  Time  Water Level  Methane (ppm)  CO2 (ppm)
0  674  01-01-2022   NaN        71.82         960.20    2117.10
1  646  01-01-2022   NaN        75.71         219.93     911.19
2  590  01-01-2022   NaN        64.61         268.37     993.75
3  627  01-01-2022   NaN         1.84         426.10    1421.28
4  896  01-01-2022   NaN        58.11        1183.17    4334.22

In [15]:
start_date = datetime(2022, 3, 10)
for i in range(len(df['mq2'])):
    df['Water Level'][i] = round(random.uniform(5, 100), 1)    
df.head()

C:\Users\MRUNAL\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

   mq2        Date  Time  Water Level  Methane (ppm)  CO2 (ppm)
0  674  01-01-2022   NaN         18.0         960.20    2117.10
1  646  01-01-2022   NaN         45.3         219.93     911.19
2  590  01-01-2022   NaN         73.9         268.37     993.75
3  627  01-01-2022   NaN         14.5         426.10    1421.28
4  896  01-01-2022   NaN         35.2        1183.17    4334.22

In [16]:
df['Date'] = pd.date_range(start='10/3/2022', periods=len(df), freq='30T')

In [17]:
df['Dates'] = pd.to_datetime(df['Date']).dt.date
df['Time'] = pd.to_datetime(df['Date']).dt.time

In [18]:
df=df.drop('Date', axis=1)

In [19]:
df.head()

   mq2      Time  Water Level  Methane (ppm)  CO2 (ppm)       Dates
0  674  00:00:00         18.0         960.20    2117.10  2022-10-03
1  646  00:30:00         45.3         219.93     911.19  2022-10-03
2  590  01:00:00         73.9         268.37     993.75  2022-10-03
3  627  01:30:00         14.5         426.10    1421.28  2022-10-03
4  896  02:00:00         35.2        1183.17    4334.22  2022-10-03

In [20]:
df.describe()

               mq2  Water Level  Methane (ppm)    CO2 (ppm)
count  1844.000000  1844.000000    1844.000000  1844.000000
mean    653.442516    52.869740    1454.953856  2654.530076
std     173.404324    27.502648    2123.835381  2572.497448
min     346.000000     5.000000      10.140000   200.760000
25%     517.000000    29.275000      79.067500   668.595000
50%     622.000000    53.100000     495.010000  1825.770000
75%     746.000000    76.300000    1550.710000  3486.497500
max    1388.000000   100.000000    7996.540000  9983.750000

In [21]:
# Set the threshold values for methane and CO2
methane_threshold = 1000
co2_threshold = 3000

# Apply threshold checks and generate alerts
df['Methane Alert'] = df['Methane (ppm)'] > methane_threshold
df['CO2 Alert'] = df['CO2 (ppm)'] > co2_threshold
df.head()

,mq2,Time,Water Level,Methane (ppm),CO2 (ppm),Dates,Methane Alert,CO2 Alert
0,674,00:00:00,18.0,960.20,2117.10,2022-10-03,False,False
1,646,00:30:00,45.3,219.93,911.19,2022-10-03,False,False
2,590,01:00:00,73.9,268.37,993.75,2022-10-03,False,False
3,627,01:30:00,14.5,426.10,1421.28,2022-10-03,False,False
4,896,02:00:00,35.2,1183.17,4334.22,2022-10-03,True,True

In [67]:
//df.to_csv('manhole final.csv', index=False)

In [113]:
df['Dates'] = df['Dates'].astype(str)
df['Time'] = df['Time'].astype(str)

In [22]:
df=df.drop('Dates', axis=1)

In [70]:
X = df.drop('Methane Alert', axis=1)
y_methane = df['Methane Alert']
y_co2 = df['CO2 Alert']

In [71]:
X = X.drop('CO2 Alert', axis=1)

In [58]:
X = X.drop('CO2 (ppm)', axis=1)

In [63]:
X = X.drop('mq2', axis=1)

In [72]:
X

      mq2      Time  Water Level  Methane (ppm)  CO2 (ppm)
0     674  00:00:00         18.0         960.20    2117.10
1     646  00:30:00         45.3         219.93     911.19
2     590  01:00:00         73.9         268.37     993.75
3     627  01:30:00         14.5         426.10    1421.28
4     896  02:00:00         35.2        1183.17    4334.22
...   ...       ...          ...            ...        ...
1839  826  07:30:00         92.5        3997.20    4158.94
1840  821  08:00:00         27.5        4073.88    3887.42
1841  832  08:30:00         79.6        6545.17    3455.47
1842  840  09:00:00         91.6        3987.65    6094.62
1843  840  09:30:00         29.7        2569.91    5074.99

[1844 rows x 5 columns]

In [73]:
X_train, X_test, y_train, y_test = train_test_split(X, y_methane, test_size=0.2, random_state=42)

In [74]:
from sklearn.ensemble import RandomForestClassifier

rclassifier = RandomForestClassifier(criterion='entropy', random_state=0)  
rclassifier.fit(X_train._get_numeric_data(), y_train)

dt_y_pred= rclassifier.predict(X_test._get_numeric_data())

from sklearn.metrics import accuracy_score,precision_score,recall_score
scor1e=accuracy_score(y_test,dt_y_pred)

C:\Users\MRUNAL\Anaconda3\lib\site-packages\sklearn\ensemble\forest.py:245: FutureWarning: The default value of n_estimators will change from 10 in version 0.20 to 100 in 0.22.
  "10 in version 0.20 to 100 in 0.22.", FutureWarning)

In [75]:
scor1e

1.0

In [68]:
from sklearn.tree import DecisionTreeClassifier
classifier = DecisionTreeClassifier(criterion='entropy', random_state=0)
classifier.fit(X_train._get_numeric_data(), y_train)

dt_y_pred= classifier.predict(X_test._get_numeric_data())

In [69]:
score=accuracy_score(y_test,dt_y_pred)
score

1.0

In [69]:
pip install scikit-learn xgboost

Requirement already satisfied: scikit-learn in c:\users\mrunal\anaconda3\lib\site-packages (0.21.3)
Collecting xgboost
  Downloading https://files.pythonhosted.org/packages/24/14/d9ecb9fa86727f51bfb35f1c2b0428ebc6cd5ffde24c5e2dc583d3575a6f/xgboost-1.6.2-py3-none-win_amd64.whl (125.4MB)
Requirement already satisfied: joblib>=0.11 in c:\users\mrunal\anaconda3\lib\site-packages (from scikit-learn) (0.13.2)
Requirement already satisfied: numpy>=1.11.0 in c:\users\mrunal\anaconda3\lib\site-packages (from scikit-learn) (1.16.5)
Requirement already satisfied: scipy>=0.17.0 in c:\users\mrunal\anaconda3\lib\site-packages (from scikit-learn) (1.3.1)
Installing collected packages: xgboost
Successfully installed xgboost-1.6.2
Note: you may need to restart the kernel to use updated packages.

In [23]:
import xgboost as xgb
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score, confusion_matrix
from sklearn.metrics import mean_squared_error

In [55]:
X_train, X_test, y_train, y_test = train_test_split(X, y_methane, test_size=0.2, random_state=42)

# Train the XGBoost model for methane prediction
model_methane = xgb.XGBRegressor()
model_methane.fit(X_train._get_numeric_data(), y_train)

# Make predictions on the test set for methane
y_pred_methane = model_methane.predict(X_test._get_numeric_data())

# Evaluate the performance of the model for methane prediction
mse_methane = mean_squared_error(y_test, y_pred_methane)
print("MSE for Methane Prediction:", mse_methane)

MSE for Methane Prediction: 4.2746598e-10